Repository: DanielEFGS/features-21
Catalog: src/locales/messages.*.xlf
Languages: es

# rxjsDemoDebounced
source: Debounced signal
es: Señal con debounce

# rxjsDemoNormalized
source: Normalized via toObservable
es: Normalizado con toObservable

# rxjsDemoLogTitle
source: Output stream
es: Flujo de salida

# rxjsDemoEmpty
source: No output yet. Click Apply to emit an event.
es: Sin resultados aún. Haz clic en Aplicar para emitir un evento.

# signalsDemoEyebrow
source: Signals
es: Señales

# signalsDemoTitle
source: Quick compare panel
es: Panel de comparación rápida

# signalsDemoClear
source: Clear
es: Limpiar

# signalsDemoAdd
source: Add
es: Agregar

# signalsDemoRemove
source: Remove
es: Quitar

# signalsDemoEmpty
source: Select up to three Pokemon to compare.
es: Selecciona hasta tres Pokémon para comparar.

# signalsDemoSummary
source: Selected: count/3
es: Seleccionados: count/3

# styleDemoEyebrow
source: Style Guide
es: Guí­a de estilo

# styleDemoTitle
source: Naming validator
es: Validador de nombres

# styleDemoSubtitle
source: Check selectors, class names, and file bases.
es: Revisa selectores, clases y bases de archivo.

# styleDemoPrefixLabel
source: Project prefix
es: Prefijo de proyecto

# styleDemoPrefixOk
source: Prefix is unique and kebab-case.
es: El prefijo es único y en kebab-case.

# styleDemoPrefixSuggestion
source: Suggestion:
es: Sugerencia:

# styleDemoSelectorLabel
source: Selector
es: Selector CSS

# styleDemoSelectorOk
source: Valid selector.
es: Selector válido.

# styleDemoSelectorSuggestion
source: Suggestion:
es: Sugerencia:

# styleDemoClassLabel
source: Class name
es: Nombre de clase

# styleDemoClassOk
source: Valid class name.
es: Nombre de clase válido.

# styleDemoClassSuggestion
source: Suggestion:
es: Sugerencia:

# styleDemoFileLabel
source: File base
es: Base de archivo

# styleDemoFileOk
source: Valid file base.
es: Base de archivo válida.

# styleDemoFileSuggestion
source: Suggestion:
es: Sugerencia:

# styleDemoSummaryError
source: Fix naming to match the project conventions.
es: Corrige los nombres para cumplir las convenciones del proyecto.

# styleDemoSummaryOk
source: All naming rules pass for this feature.
es: Todas las reglas de nombres pasan para esta feature.

# twDemoTitle
source: Utility preview
es: Vista previa de utilidades

# twDemoSubtitle
source: Toggle common utilities and see the applied class string.
es: Activa utilidades comunes y mira la cadena de clases aplicada.

# twDemoOptions
source: Options
es: Opciones

# twDemoPreviewLabel
source: Preview card
es: Tarjeta de vista previa

# twDemoCardTitle
source: Utility stack
es: Stack de utilidades

# twDemoCardBody
source: Spacing, radius, shadow, accent, and outline are all toggleable.
es: Espaciado, radios, sombra, acento y borde se pueden alternar.

# twDemoClassLabel
source: Class string
es: Cadena de clases

# twDemoPaddingDesc
source: Apply generous spacing.
es: Aplica espaciado generoso.

# twDemoRadius
source: Rounded corners
es: Esquinas redondeadas

# twDemoRadiusDesc
source: Soften edges.
es: Suaviza los bordes.

# twDemoShadow
source: Shadow
es: Sombra

# twDemoShadowDesc
source: Lift the card slightly.
es: Eleva ligeramente la tarjeta.

# twDemoAccent
source: Accent background
es: Fondo de acento

# twDemoAccentDesc
source: Subtle neutral fill.
es: Agrega un color de acento.

# twDemoOutline
source: Outline
es: Contorno

# twDemoOutlineDesc
source: Add a focus ring style.
es: Traza un borde exterior.

# testingDemoEyebrow
source: Testing
es: Pruebas

# testingDemoTitle
source: SSR-safe testing checklist
es: Checklist de pruebas seguras para SSR

# testingDemoSubtitle
source: Mock HTTP, drive routing, and guard client-only APIs.
es: Mockea HTTP, conduce el enrutado y protege APIs solo de cliente.

# testingDemoAriaChecklist
source: Testing checklist
es: Checklist de pruebas

# testingDemoReadinessLabel
source: Readiness:
es: Preparación:

# testingDemoSummaryOk
source: Tests are SSR-safe with mocked HTTP and guarded client APIs.
es: Las pruebas son seguras para SSR con HTTP simulado y APIs de cliente protegidas.

# testingDemoMissingLabel
source: Missing:
es: Falta:

# testingDemoItemSsr
source: SSR-safe setup
es: Configuración SSR-safe

# testingDemoItemSsrDesc
source: No window/document; use guards/mocks.
es: Sin window/document; usa guards o mocks.

# testingDemoItemHttp
source: HTTP mocked
es: HTTP simulado

# testingDemoItemHttpDesc
source: HttpTestingController flushes requests.
es: HttpTestingController resuelve las peticiones.

# testingDemoItemRouterDesc
source: RouterTestingHarness drives navigation.
es: RouterTestingHarness conduce la navegación.

# testingDemoItemHydrationDesc
source: Branches covered for server/client differences.
es: Ramas cubiertas para diferencias server/cliente.

# testingDemoItemA11y
source: A11y smoke
es: Smoke de accesibilidad

# testingDemoItemA11yDesc
source: Optional axe-core or similar check for markup.
es: Opcional axe-core u otra verificación del marcado.

# labCodeDemoEmpty
source: No code available yet.
es: Aún no hay código disponible.

# labExerciseEyebrow
source: Exercise
es: Ejercicio

# labExerciseTasksTitle
source: Tasks
es: Tareas

# labExerciseSuccessTitle
source: Success criteria
es: Criterios de éxito

# labExerciseStretchTitle
source: Stretch goals
es: Objetivos extra

# labHeroBack
source: Back to index
es: Volver al í­ndice

# labReferencesTitle
source: References
es: Referencias

# labTocCloseAria
source: Close table of contents
es: Cerrar tabla de contenidos

# labTocOnThisPage
source: On this page
es: En esta página

# labTocAria
source: Lab sections
es: Secciones del lab

# labTocExercise
source: Exercise
es: Ejercicio

# labTocReferences
source: References
es: Referencias

# labsIndexEyebrow
source: Labs
es: Laboratorios

# labsIndexTitle
source: Index
es: Índice

# labsIndexHint
source: Isolated labs per feature to learn and measure.
es: Labs aislados por feature para aprender y medir.

# labStatusPlanned
source: planned
es: planificado

# labStatusInProgress
source: in-progress
es: en progreso

# labStatusDone
source: done
es: listo

# labLevelBeginner
source: Beginner
es: Principiante

# labLevelIntermediate
source: Intermediate
es: Intermedio

# labLevelAdvanced
source: Advanced
es: Avanzado

# pokedexDetailEyebrow
source: Pokedex
es: Pokédex

# pokedexDetailTitle
source: Detail
es: Detalle

# pokedexDetailBackAria
source: Go back
es: Volver

# pokedexDetailBack
source: Back
es: Atrás

# pokedexDetailHint
source: Base v1: name, id, images, types, and stats.
es: Base v1: nombre, id, imágenes, tipos y stats.

# pokedexDetailNoImage
source: No image
es: Sin imagen

# pokedexDetailHeight
source: Height
es: Altura

# pokedexDetailWeight
source: Weight
es: Peso

# pokedexDetailBaseExp
source: Base exp
es: Exp base

# pokedexDetailOrder
source: Order
es: Orden

# pokedexDetailStatsTitle
source: Base stats
es: Estadísticas base

# pokedexDetailAbilitiesTitle
source: Abilities
es: Habilidades

# pokedexDetailHidden
source: Hidden
es: Oculta

# pokedexListEyebrow
source: Pokedex
es: Pokédex

# pokedexListTitle
source: List
es: Lista

# pokedexListHint
source: Base v1: list, pagination, sorting, and simple filters.
es: Base v1: lista, paginación, ordenamiento y filtros simples.

# pokedexListSearchLabel
source: Search
es: Buscar

# pokedexListSearchPlaceholder
source: Pokemon name
es: Nombre del Pokémon

# pokedexListTypeLabel
source: Type
es: Tipo

# pokedexListTypeAll
source: All types
es: Todos los tipos

# pokedexListTypeLoading
source: Loading...
es: Cargando...

# pokedexListTypeError
source: Unavailable
es: No disponible

# pokedexListOrderLabel
source: Order
es: Orden

# pokedexListDirLabel
source: Direction
es: Dirección

# pokedexListRetry
source: Retry
es: Reintentar

# pokedexListEmpty
source: No results to display.
es: Sin resultados para mostrar.

# pokedexListNoImage
source: No image
es: Sin imagen

# pokedexListPrev
source: Previous
es: Anterior

# pokedexListPager
source: Page {{ page() }} of {{ totalPages() }}
es: Página {{ page + 1 }} de {{ totalPages() }}

# pokedexListNext
source: Next
es: Siguiente
