Repository: DanielEFGS/features-21
Catalog: src/locales/messages.*.xlf
Languages: es

source: Skip to content
es: Ir al contenido

# docsCategoryPlaceholder
source: All
es: Todos

# docsDocPlaceholder
source: Document
es: Documento

# docsDocSearchPlaceholder
source: Search document
es: Buscar documento

# labSignalsSummary
source: Model local state with signals, derive values with computed, and use effects for side effects.
es: Modela estado local con signals, deriva valores con computed y usa effects para efectos secundarios.

# labHttpResourceSummary
source: Reactive data fetching with resources, loading states, and abortable requests.
es: Obtén datos de forma reactiva con resources, gestiona estados de carga y solicitudes cancelables.

# labRxjsInteropSummary
source: Bridge signals with observables using toSignal and toObservable.
es: Conecta signals y observables usando toSignal y toObservable.

# labRoutingSummary
source: Lazy routes, route data, and guards with modern routing patterns.
es: Rutas lazy, datos de ruta y guards con patrones de enrutado modernos.

# labDiSummary
source: Inject services with inject(), tokens, and route-level providers.
es: Inyecta servicios con inject(), tokens y proveedores a nivel de ruta.

# labFormsSummary
source: Signal Forms with model-driven validation, field state, and schema rules.
es: Forms con signals, validación basada en modelo, estado de campos y reglas de esquema.

# labAnimationsSummary
source: Enter/leave animations, reusable CSS motion, and route transitions.
es: Animaciones de entrada/salida, motion CSS reutilizable y transiciones de rutas.

# labStyleGuideSummary
source: Apply naming, structure, and lint rules consistently across features.
es: Aplica nomenclatura, estructura y reglas de lint de forma consistente en las features.

# labTailwindSummary
source: Build clean UI with utility-first patterns and reuse shared primitives.
es: Construye UI limpia con patrones utility-first y reutiliza primitivas compartidas.

# labA11ySummary
source: Use Angular Aria and CDK focus helpers to keep UI accessible.
es: Usa Angular Aria y los helpers de foco del CDK para mantener la accesibilidad.

# labPwaSummary
source: App shell caching, install flows, and update prompts (no API caching).
es: Cachea el app shell, gestiona instalación y avisos de actualización (sin cachear la API).

# labTestingSummary
source: Unit patterns with Vitest: SSR-safe specs, HTTP mocks, router harness.
es: Patrones de unit tests con Vitest: specs seguras para SSR, mocks HTTP, harness de router.

# labPerformanceSummary
source: Budgets, defer/lazy strategies, and asset/network guardrails.
es: Budgets, estrategias defer/lazy y guardrails de assets/red.

# labCustomBuildSummary
source: Design a custom build pipeline with cache strategy and SSR checks.
es: Diseña un pipeline de build personalizado con estrategia de caché y checks de SSR.

# labCdkSummary
source: CDK overlays, focus tools, and portals for reusable primitives.
es: Overlays de CDK, herramientas de foco y portals para primitivas reutilizables.

# labSignalsDemoTitle
source: Signals quick compare demo
es: Demo rápida de comparación con Signals

# labSignalsDemoDescription
source: Pick up to three Pokemon and see derived state update instantly.
es: Elige hasta tres Pokémon y observa cómo el estado derivado se actualiza al instante.

# labHttpResourceDemoTitle
source: httpResource lookup demo
es: Demo de búsqueda con httpResource

# labHttpResourceDemoDescription
source: Fetch a Pokemon by name and track loading and error states.
es: Busca un Pokémon por nombre y controla estados de carga y error.

# labRxjsInteropDemoTitle
source: RxJS interop demo
es: Demo de interoperabilidad RxJS

# labRxjsInteropDemoDescription
source: Debounce input into a signal, emit an output, and observe it as a stream.
es: Haz debounce de la entrada a un signal, emite una salida y obsérvala como stream.

# labRoutingDemoTitle
source: Routing demo
es: Demo de routing

# labRoutingDemoDescription
source: Swap panels by updating query params without leaving the lab.
es: Intercambia paneles actualizando query params sin salir del lab.

# labDiDemoTitle
source: DI demo
es: Demo de DI

# labDiDemoDescription
source: Share notes through a service and compare provider scope.
es: Comparte notas con un servicio y compara el alcance de los proveedores.

# labFormsDemoTitle
source: Signal Forms demo
es: Demo de Signal Forms

# labFormsDemoDescription
source: Build a trainer contact form with schema validation and field state feedback.
es: Crea un formulario de entrenador con validación de esquema y feedback de estado de campos.

# labAnimationsDemoTitle
source: Animations demo
es: Demo de animaciones

# labAnimationsDemoDescription
source: Enter/leave motion with a staggered toast list.
es: Animaciones de entrada/salida con una lista de toasts escalonada.

# labStyleGuideDemoTitle
source: Style guide demo
es: Demo de guía de estilo

# labStyleGuideDemoDescription
source: Validate selectors, class names, and file bases.
es: Valida selectores, nombres de clases y bases de archivos.

# labTailwindDemoTitle
source: Tailwind demo
es: Demo de Tailwind

# labTailwindDemoDescription
source: Toggle common utilities and see the resulting class string.
es: Activa/desactiva utilidades comunes y observa la cadena de clases resultante.

# labA11yDemoTitle
source: A11y & Aria demo
es: Demo de A11y y Aria

# labA11yDemoDescription
source: Labeled fields, helper text, and a live region for results.
es: Campos etiquetados, texto de ayuda y una región en vivo para resultados.

# labPwaDemoTitle
source: PWA checklist demo
es: Demo de checklist PWA

# labPwaDemoDescription
source: App-shell readiness with no API caching and a clear update prompt.
es: Preparación del app-shell sin caché de API y con un aviso de actualización claro.

# labTestingDemoTitle
source: Testing checklist demo
es: Demo de checklist de testing

# labTestingDemoDescription
source: SSR-safe specs with HTTP mocks and router harness.
es: Specs seguras para SSR con mocks HTTP y harness de router.

# labPerformanceDemoTitle
source: Performance checklist demo
es: Demo de checklist de performance

# labPerformanceDemoDescription
source: Budgets, defer plan, and asset/network guardrails.
es: Budgets, plan de defer y guardrails de assets/red.

# labCustomBuildDemoTitle
source: Custom build checklist demo
es: Demo de checklist de build personalizado

# labCustomBuildDemoDescription
source: Goals, pipeline steps, caching, SSR checks, rollback.
es: Objetivos, pasos del pipeline, caché, checks de SSR y rollback.

# labCdkDemoTitle
source: CDK checklist demo
es: Demo de checklist CDK

# labCdkDemoDescription
source: Overlay, focus, portal, and focus-restore steps.
es: Pasos de overlay, foco, portal y restauración de foco.

# pokedexTypePlaceholder
source: All types
es: Todos los tipos

# pokedexTypeSearchPlaceholder
source: Search type
es: Buscar tipo

# pokedexSortPlaceholder
source: Order
es: Orden

# pokedexDirPlaceholder
source: Direction
es: Dirección

# logoTitle
source: Features Angular v21
es: Funcionalidades Angular v21

# brandNote
source: SSR + Labs
es: SSR + Laboratorios

# navHome
source: Home
es: Inicio

# navPokedex
source: Pokedex
es: Pokédex

# navLabs
source: Labs
es: Laboratorios

# navDocs
source: Docs
es: Documentación

# menuLabel
source: Menu
es: Menú

# navCloseLabel
source: Close menu
es: Cerrar menú

# localeTriggerLabel
source: Change language
es: Cambiar idioma

# localeDialogLabel
source: Select language
es: Seleccionar idioma

# localeTitle
source: Select language
es: Seleccionar idioma

# localeSpanish
source: Spanish
es: Español

# localeEnglish
source: English
es: Inglés

# footerStack
source: Angular v21 | SSR + Hydration
es: Angular v21 | SSR + Hidratación

# footerApi
source: PokEAPI v2
es: PokéAPI v2

# docsEyebrow
source: Docs
es: Documentación

# docsTitle
source: Documentation
es: Documentación

# docsHint
source: Quick index for architecture, SSR/hydration, labs, and ADRs.
es: Índice rápido de arquitectura, SSR/hidratación, labs y ADRs.

# docsCoreTitle
source: Project docs
es: Docs de proyecto

# docsCoreHint
source: Architecture, rendering, performance, and labs index.
es: Índice de arquitectura, render, performance y labs.

# docsLabsTitle
source: Lab writeups
es: Laboratorios

# docsLabsHint
source: Per-feature guides, exercises, and references.
es: Guías, ejercicios y referencias por feature.

# docsAdrTitle
source: ADRs
es: ADR

# docsAdrHint
source: Snapshot of key trade-offs and outcomes.
es: Resumen de decisiones y resultados clave.

# docsPreviewLabel
source: Preview
es: Vista previa

# docsCategoryLabel
source: Category
es: Categoría

# docsCategoryAll
source: All
es: Todo

# docsCategoryCore
source: Core
es: Núcleo

# docsCategoryLabs
source: Labs
es: Laboratorios

# docsCategoryAdrs
source: ADRs
es: ADR

# docsFilterToggleLabel
source: Toggle filters
es: Alternar filtros

# docsDocumentLabel
source: Document
es: Documento

# docsPrev
source: Prev
es: Anterior

# docsNext
source: Next
es: Siguiente

# docsClose
source: Close
es: Cerrar

# docsLoading
source: Loading...
es: Cargando...

# docsModalSelect
source: Select a document
es: Selecciona un documento

# docsModalChoose
source: Choose a doc to load its content here.
es: Elige un documento para ver su contenido aquí.

# docsPreviewPlaceholder
source: Select a document to preview its contents here.
es: Selecciona un documento para previsualizar su contenido aquí.

# homeEyebrow
source: Features Angular v21
es: Funcionalidades Angular v21

# homeHeroTitle
source: Clear technical baseline, performance first, real learning
es: Base técnica clara, performance primero, aprendizaje real

# homeHeroLead
source: This app separates real routes and labs to explain modern features with measurable and traceable examples.
es: Esta app separa rutas reales y labs para explicar features modernas con ejemplos medibles y trazables.

# homeCtaPokedex
source: Go to Pokedex
es: Ir a la Pokédex

# homeCtaLabs
source: View Labs
es: Ver Labs

# homeStackTitle
source: Baseline stack
es: Stack base

# homeStackItem1
source: Angular 21 + SSR
es: Angular 21 y SSR

# homeStackItem2
source: Preline + Tailwind
es: Preline y Tailwind

# homeStackItem3
source: RX + Signals
es: RX y Signals

# homeStackItem4
source: PokEAPI v2
es: PokÉAPI v2

# homeStackTag
source: Features Angular v21
es: Funcionalidades Angular v21

# homeFeaturesEyebrow
source: Features
es: Funcionalidades

# homeFeaturesTitle
source: Project foundation
es: Fundación del proyecto

# homeFeature1Title
source: Routes with render modes
es: Rutas con modos de render

# homeFeature1Desc
source: SSG on home, SSR on Pokedex, CSR on labs.
es: SSG en home, SSR en Pokédex, CSR en labs.

# homeFeature2Title
source: Controlled data layer
es: Capa de datos controlada

# homeFeature2Desc
source: Typed client, cache, dedupe, and limited concurrency.
es: Cliente tipado, caché, dedupe y concurrencia limitada.

# homeFeature3Title
source: Minimal and accessible UI
es: UI minimalista y accesible

# homeFeature3Desc
source: Tailwind, CDK, and Angular Aria with end-to-end keyboard support.
es: Tailwind, CDK y Angular Aria con soporte completo de teclado.

# a11yDemoEyebrow
source: A11y & Aria
es: Accesibilidad y ARIA

# a11yDemoTitle
source: Accessible filter panel
es: Panel de filtros accesible

# a11yDemoSubtitle
source: Labels, helper text, and live updates without stealing focus.
es: Etiquetas, ayudas y actualizaciones en vivo sin robar foco.

# a11yDemoHelp
source: All fields are required. Results update in the status region below.
es: Todos los campos son obligatorios. Los resultados se actualizan en la región de estado inferior.

# a11yDemoQueryLabel
source: Search query
es: Búsqueda

# a11yDemoQueryHelp
source: Keep it short and specific.
es: Mantenla corta y específica.

# a11yDemoTypeLabel
source: Pokemon type
es: Tipo de Pokémon

# a11yDemoTypeHelp
source: Use arrow keys or tab to move through options.
es: Usa flechas o Tab para moverte por las opciones.

# a11yDemoApply
source: Apply filters
es: Aplicar filtros

# a11yDemoTypeElectric
source: Electric
es: Eléctrico

# a11yDemoTypeFire
source: Fire
es: Fuego

# a11yDemoTypeWater
source: Water
es: Agua

# a11yDemoAnyQuery
source: any query
es: cualquier búsqueda

# a11yDemoResults
source: count results for "query" (typeLabel).
es: count resultados para "query" (typeLabel).

# animDemoEyebrow
source: Animations
es: Animaciones

# animDemoTitle
source: Toast queue
es: Cola de toasts

# animDemoSubtitle
source: Enter/leave motion with a staggered list.
es: Animación de entrada/salida con lista escalonada.

# animDemoAdd
source: Add toast
es: Agregar toast

# animDemoClear
source: Clear all
es: Limpiar todo

# animDemoClose
source: Close
es: Cerrar

# animDemoEmptyHint
source: Add a toast to see the entry animation.
es: Agrega un toast para ver la animación de entrada.

# animDemoEmpty
source: No toasts in the queue.
es: No hay toasts en la cola.

# animDemoActive
source: Active toasts: this.toastCount()
es: Toasts activos:

# animDemoSaved
source: Saved update #messageIndex
es: Actualización guardada #

# cdkDemoTitle
source: Overlay & focus checklist
es: Checklist de overlay y foco

# cdkDemoSubtitle
source: Overlay plan, focus trapping, portals, and focus restore.
es: Plan de overlay, focus trap, portales y restaurar foco.

# cdkDemoAriaChecklist
source: CDK checklist
es: Checklist de CDK

# cdkDemoReadinessLabel
source: Readiness:
es: Preparación:

# cdkDemoSummaryOk
source: Overlay plan covers focus, portals, and accessibility.
es: El plan de overlay cubre foco, portales y accesibilidad.

# cdkDemoMissingLabel
source: Missing:
es: Falta:

# cdkDemoItemOverlay
source: Overlay plan
es: Plan de overlay

# cdkDemoItemOverlayDesc
source: Backdrop + escape to close; positioned pane.
es: Backdrop + Escape para cerrar; panel posicionado.

# cdkDemoItemFocus
source: Focus helpers
es: Ayudas de foco

# cdkDemoItemFocusDesc
source: cdkFocusInitial and FocusTrap configured.
es: cdkFocusInitial y FocusTrap configurados.

# cdkDemoItemPortal
source: Portal usage
es: Uso de portales

# cdkDemoItemPortalDesc
source: Content rendered via portal/outlet.
es: Contenido renderizado vía portal/outlet.

# cdkDemoItemA11y
source: A11y
es: Accesibilidad

# cdkDemoItemA11yDesc
source: Labels/aria-labelledby applied to surface.
es: Labels/aria-labelledby aplicados a la superficie.

# cdkDemoItemRestore
source: Restore focus
es: Restaurar foco

# cdkDemoItemRestoreDesc
source: Return focus to trigger on close.
es: Devolver foco al disparador al cerrar.

# customDemoEyebrow
source: Custom build
es: Build personalizada

# customDemoTitle
source: Pipeline plan checklist
es: Checklist del pipeline

# customDemoSubtitle
source: Goals, steps, cache, SSR checks, and rollback.
es: Objetivos, pasos, caché, checks SSR y rollback.

# customDemoAriaChecklist
source: Custom build checklist
es: Checklist de build personalizada

# customDemoReadinessLabel
source: Readiness:
es: Preparación:

# customDemoSummaryOk
source: Pipeline is planned with cache, SSR checks, and rollback.
es: Pipeline planificado con caché, checks SSR y rollback.

# customDemoMissingLabel
source: Missing:
es: Falta:

# customDemoItemGoals
source: Goals/constraints
es: Objetivos/restricciones

# customDemoItemGoalsDesc
source: Metrics + constraints written down.
es: Métricas y restricciones escritas.

# customDemoItemPipeline
source: Pipeline steps
es: Pasos del pipeline

# customDemoItemPipelineDesc
source: Lint → test → build with tools noted.
es: Lint → test → build con herramientas anotadas.

# customDemoItemCache
source: Cache/artifacts
es: Cache/artefactos

# customDemoItemCacheDesc
source: Cache keys + invalidation plan set.
es: Claves de caché y plan de invalidación listos.

# customDemoItemSsr
source: SSR/CSR checks
es: Checks SSR/CSR

# customDemoItemSsrDesc
source: Smoke render + hydration watch included.
es: Render smoke + vigilancia de hidratación incluida.

# customDemoItemRollback
source: Rollback/observability
es: Rollback/observabilidad

# customDemoItemRollbackDesc
source: Fallback and logs/metrics defined.
es: Fallback y logs/métricas definidos.

# diDemoTitle
source: Notes service scope
es: Alcance del servicio de notas

# diDemoSubtitle
source: Inject a shared service and see how provider scope changes state.
es: Inyecta un servicio compartido y observa cómo el alcance del proveedor cambia el estado.

# diDemoScopeLabel
source: Provider scope
es: Ámbito del proveedor

# diDemoNewNote
source: New note
es: Nueva nota

# diDemoAdd
source: Add
es: Agregar

# diDemoClear
source: Clear
es: Limpiar

# diDemoListTitle
source: Shared notes
es: Notas compartidas

# diDemoEmpty
source: Add a note to see it shared within this component scope.
es: Agrega una nota para verla compartida en este ámbito de componente.

# diDemoScopeValue
source: Component provider
es: Proveedor del componente

# formsDemoEyebrow
source: Signal Forms
es: Formularios con señales

# formsDemoTitle
source: Trainer contact form
es: Formulario de contacto del entrenador

# formsDemoSubtitle
source: Model-driven fields with schema validation and field state feedback.
es: Campos dirigidos por modelo con validación de esquema y feedback de estado.

# formsDemoPrefill
source: Prefill
es: Autocompletar

# formsDemoReset
source: Reset
es: Restablecer

# formsDemoName
source: Trainer name
es: Nombre

# formsDemoAccept
source: I accept the terms
es: Acepto los términos

# formsDemoTermsError
source: Accept the terms to continue.
es: Acepta los términos para continuar.

# formsDemoSave
source: Save
es: Guardar

# formsDemoNameReq
source: Name is required.
es: Nombre es requerido.

# formsDemoEmailReq
source: Email is required.
es: Email es requerido.

# formsDemoEmailValid
source: Enter a valid email address.
es: Ingresa un correo válido.

# formsDemoTermsReq
source: Accept the terms to continue.
es: Acepta los términos para continuar.

# formsDemoReady
source: Ready to save.
es: Listo para guardar.

# formsDemoFix
source: Fix the highlighted fields to continue.
es: Corrige los campos resaltados para continuar.

# formsDemoComplete
source: Complete the fields to enable Save.
es: Completa los campos para habilitar Guardar.

# httpDemoEyebrow
source: httpResource
es: Recurso HTTP

# httpDemoTitle
source: Pokemon lookup
es: Búsqueda de Pokémon

# httpDemoSubtitle
source: Fetch a Pokemon by name and watch the resource state update.
es: Busca un Pokémon por nombre y mira el estado del recurso.

# httpDemoLabel
source: Pokemon name
es: Nombre del Pokémon

# httpDemoLoad
source: Load
es: Cargar

# httpDemoLoading
source: Loading...
es: Cargando...

# httpDemoEmpty
source: Search for a Pokemon to begin.
es: Busca un Pokémon para empezar.

# httpDemoError
source: Unable to load the Pokemon. Try another name.
es: No se pudo cargar el Pokémon. Prueba otro nombre.

# perfDemoEyebrow
source: Performance
es: Rendimiento

# perfDemoTitle
source: Guardrails checklist
es: Checklist de barandas

# perfDemoSubtitle
source: Budgets, defer plan, assets, and network discipline.
es: Presupuestos, plan de defer, assets y disciplina de red.

# perfDemoAriaChecklist
source: Performance checklist
es: Checklist de performance

# perfDemoReadinessLabel
source: Readiness:
es: Preparación:

# perfDemoSummaryOk
source: Guardrails set: budgets, defer, assets, and network controls.
es: Barandas listas: presupuestos, defer, assets y control de red.

# perfDemoMissingLabel
source: Missing:
es: Falta:

# perfDemoItemBudgets
source: Budgets set
es: Presupuestos definidos

# perfDemoItemBudgetsDesc
source: JS/CSS limits defined and monitored.
es: Límites de JS/CSS definidos y monitoreados.

# perfDemoItemDefer
source: Defer plan
es: Plan de defer

# perfDemoItemDeferDesc
source: Non-critical views/widgets deferred or lazy.
es: Vistas/widgets no críticos diferidos o lazy.

# perfDemoItemImages
source: Images optimized
es: Imágenes optimizadas

# perfDemoItemImagesDesc
source: NgOptimizedImage + sizes; lazy non-critical.
es: NgOptimizedImage + sizes; lazy en lo no crítico.

# perfDemoItemFonts
source: Fonts tamed
es: Fuentes controladas

# perfDemoItemNetwork
source: Network disciplined
es: Red disciplinada

# perfDemoItemNetworkDesc
source: Concurrency capped, dedupe in place.
es: Concurrencia limitada, deduplicación activa.

# pwaDemoTitle
source: App-shell readiness
es: Progreso hacia instalación

# pwaDemoSubtitle
source: Keep installability clear and avoid caching API data.
es: Checklist para habilitar prompt de instalación (sin API de caché).

# pwaDemoAriaChecklist
source: PWA checklist
es: Checklist de PWA

# pwaDemoReadiness
source: Readiness: {{ readiness().score }}%
es: Preparación: {{ readiness().score }}%

# pwaDemoReady
source: Ready: app shell caches static assets and avoids API caching.
es: Listo: app shell cachea assets estáticos y evita cachear la API.

# pwaDemoMissing
source: Missing: {{ readiness().missing.join(', ') }}
es: Falta: {{ readiness().missing.join(', ') }}

# pwaDemoManifest
source: Manifest & icons
es: Manifest e íconos

# pwaDemoManifestDesc
source: Valid name, start_url, scope, icons 192/512.
es: Nombre, start_url, scope válidos; íconos 192/512.

# pwaDemoAppShell
source: App shell cache
es: Cache de app shell

# pwaDemoAppShellDesc
source: Static assets cached, routes fall back to index.
es: Assets estáticos en caché; rutas hacen fallback al index.

# pwaDemoNoApi
source: No API caching
es: Sin caché de API

# pwaDemoNoApiDesc
source: External data not added to SW config.
es: Datos externos no se agregan a la configuración del SW.

# pwaDemoUpdatePrompt
source: Update prompt
es: Prompt de actualización

# pwaDemoUpdateDesc
source: SwUpdate available → prompt → activateUpdate().
es: SwUpdate disponible → prompt → activateUpdate().

# pwaDemoOffline
source: Offline fallback
es: Fallback offline

# pwaDemoOfflineDesc
source: Optional page for navigation failures.
es: Página opcional para fallos de navegación.

# routingDemoTitle
source: Query-param navigation
es: Navegación con query params

# routingDemoSubtitle
source: Use the router to swap panels without leaving the lab.
es: Usa el router para alternar paneles sin salir del lab.

# routingDemoUrlLabel
source: Current URL
es: URL actual

# routingDemoNavLabel
source: Active view
es: Vista activa

# routingDemoNavAria
source: Demo views
es: Vistas de demo

# routingDemoBodyOverview
source: The router reads the `view` query param and keeps the panel in sync with the URL.
es: El router lee el parámetro `view` y mantiene el panel sincronizado con la URL.

# routingDemoBodyGuards
source: A real guard would block navigation. Here we just show how a guard can change the allowed view.
es: Un guard real bloquearía la navegación. Aquí solo mostramos cómo un guard puede cambiar la vista permitida.

# routingDemoBodyResolve
source: A resolver would prefetch data for the detail panel before rendering it.
es: Un resolver prefetcharí­a datos para el panel de detalle antes de renderizarlo.

# routingDemoOverview
source: Overview
es: Resumen

# routingDemoOverviewHint
source: Default panel from the URL.
es: Panel predeterminado desde la URL.

# routingDemoGuardsHint
source: Simulate blocking access with a guard.
es: Simula bloquear acceso con un guard.

# routingDemoResolveHint
source: Simulate data preloading.
es: Simula el prefetch de datos.

# rxjsDemoEyebrow
source: RxJS interop
es: Interop RxJS

# rxjsDemoTitle
source: Debounced search helper
es: Ayudante de búsqueda con debounce

# rxjsDemoSubtitle
source: Bridge input streams into signals and expose outputs as Observables.
es: Convierte entradas en señales y expone salidas como Observables.

# rxjsDemoMetaLabel
source: Applied
es: Aplicados

# rxjsDemoSearchLabel
source: Search term
es: Término de búsqueda

# rxjsDemoApply
source: Apply
es: Aplicar
